---
kind: property
id: P:Autodesk.Revit.DB.SymbolTypeId.Joule
source: html/bdaa0919-7b8c-a0d8-1e97-cd3bd5d3606f.htm
---
# Autodesk.Revit.DB.SymbolTypeId.Joule Property

Symbol J, indicating unit Joules.

## Syntax (C#)
```csharp
public static ForgeTypeId Joule { get; }
```